{
  "basics": {
    "name": "Adrien Kohlbecker",
    "label": "Senior Software Engineer",
    "picture": "https://www.gravatar.com/avatar/2ddf351c22a32261a7b30e4d5ae3ab01?s=300",
    "email": "adrien.kohlbecker@gmail.com",
    "phone": "+44 7432 562897",
    "website": "https://adrienkohlbecker.com",
    "summary": "I'm a Senior Software Engineer and Entrepreneur with a demonstrated experience in the computer software industry. Throughout my career, I have been focusing on building reliable and scalable complex systems, as well as increasing developer efficiency through automation. I'm looking for architect roles at companies targetting developers with a strong infrastructure and tooling focus.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "London",
      "countryCode": "UK",
      "region": ""
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "adrienkohlbecker",
        "url": "https://github.com/adrienkohlbecker"
      },
      {
        "network": "LinkedIn",
        "username": "adrienkohlbecker",
        "url": "https://linkedin.com/in/adrienkohlbecker"
      }
    ]
  },
  "work": [
    {
      "company": "Datadog",
      "position": "Senior Software Engineer - Engineering Tools",
      "website": "https://www.datadoghq.com",
      "startDate": "2017-01-10",
      "summary": "Datadog is a monitoring and analytics platform for cloud-scale application infrastructure. As part of the Engineering Tools team, my role is to help people be efficient and successful at their jobs. Among other projects, I'm the main architect behind the build infrastructure used daily by 300 engineers.",
      "highlights": [
        "Built from scratch the latest generation of build infrastructure: a container-based, locked-down and multi-tenant environment",
        "Scaled up Gitlab to reliably run hundreds of build jobs per hour, with detailed monitoring and alerting",
        "Coached and assisted engineers on CI best practices and performance, shaving hundreds of man-hours of toil and wait times accross all our repositories",
        "Designed a per-project CI IAM permission system (kube2iam-like for Gitlab Docker runners)",
        "Migrated tens of infrastructure secrets from various stores to AWS SSM, making them centrally managed and auditable",
        "Developed a system to give privileged docker socket access to build jobs while keeping safe multi-tenancy",
        "Improved the systems hosting internal artifacts (both debian packages and docker images)",
        "Moved the static assets used in the production website to be built for and deployed through a CDN",
        "Transitioned our monolith python app to a virtualenv-based deployment",
        "Contributed to the virtualbox development environment used locally by engineers, including building and hosting it in AWS"
      ]
    },
    {
      "company": "Sharette",
      "position": "Co-founder and CTO",
      "website": "https://www.facebook.com/sharette.fr",
      "startDate": "2014-07-01",
      "endDate": "2016-04-04",
      "summary": "Sharette was a carpooling app designed for your every day commute, mixing public transports with car rides. As a co-founder, I had many responsibilities: leading the r&d team, product development and design, fundraising, hiring, company culture, public speaking to name a few.",
      "highlights": [
        "Developed the product and backing infrastructure from scratch, using technologies like Go, Ruby on Rails, Angular, TypeScript, PostgreSQL among others",
        "Researched and designed the routing algorithms and geo datastores powering our itinerary search",
        "Led the integration of our API in the mobile apps of the Paris public transport company (RATP)",
        "Built a fully automated and monitored infrastructure: immutable AMIs, Cloudformation, containers on Amazon ECS, Ansible, Loggly and Datadog",
        "Managed our self-hosted continuous integration with BuildKite and Docker",
        "Developed an internal CLI tool for development automation and credentials management",
        "Contributed to company-wide team building and management, hiring, company culture and development processes",
        "Oversaw the design and branding of the product and the company",
        "Open sourced the vagrant-fsnotify gem, a vagrant plugin providing filesystem notifications on shared folders",
        "Minor contributions to go-dockerclient, go-errors and definitelytyped."
      ]
    },
    {
      "company": "FidMarques",
      "position": "Software Engineer",
      "website": "https://www.fidmarques.com/",
      "startDate": "2012-10-01",
      "endDate": "2013-06-30",
      "summary": "FidMarques extracts and analyses the purchases you made at a grocery store using a picture of your receipt. While I contributed to multiple areas of the product, my primary focus was on building a resilient background processing pipeline and improving developer productivity through automation.",
      "highlights": [
        "Refactored and reorganized our backround processing pipeline using the Ruote workflow manager",
        "Automated and optimized common developer tasks into a CLI tool",
        "Designed and implemented a duplicated receipt detection algorithm, based on textual data and the Nilsimsa signature algorithm",
        "Built a POC for receipt data extraction using a Parsing Expression Grammar (with parslet)",
        "Migrated our code base to a monorepo using Rails Engines",
        "Created a unified development environment inside a virtual machine using Vagrant",
        "Opensourced two gems for controlling Resque jobs from Ruote: ruote-resque and ruote-synchronize",
        "Minor contributions to the activeadmin and ruote gems."
      ]
    },
    {
      "company": "Gullibear",
      "position": "Co-founder and CTO",
      "website": "https://www.facebook.com/iam.gullibear",
      "startDate": "2011-09-01",
      "endDate": "2012-09-30",
      "summary": "Gullibear was a social network to share and contribute to entrpreneurship projects. As a co-founder I participated in many areas of the company including development, design, product, marketing and admin tasks.",
      "highlights": [
        "Developed a social platform using python on Google App Engine, Backbone.js, HTML5, CSS3",
        "Heavily involved in product design and graphic design",
        "Organized a \"Networked Nonprofit\" conference, with talks from the Red Cross and the Fondation Abbé Pierre",
        "Presented the company at various public events"
      ]
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "École Centrale Paris, Paris (FR)",
      "studyType": "MSc Engineering",
      "area": "Computer Science & Project Management",
      "startDate": "2009-09-01",
      "endDate": "2014-12-30",
      "gpa": "",
      "courses": [
        "Highly selective master’s level engineering school",
        "Studied airplane jet engine noise reduction techniques in 100-hour team project",
        "Designed innovative open-source photography browsing UI in 200-hour team project",
        "Investigated an innovative self-service car-renting program (Domobile) in 200-hour team project.",
        "Telemarketer for the school corporate funding team",
        "Tutor for students ranging from high school level to Bachelor level",
        "Took a one month beginner chinese course at Shanghai Jiao Tong University",
        "Participated in Winstrat, a business simulation game, and won the second prize against 100+ competing teams"
      ]
    },
    {
      "institution": "Hanyang University, Seoul (SK)",
      "studyType": "Exchange semester",
      "area": "Computer Science",
      "startDate": "2012-02-01",
      "endDate": "2012-06-30",
      "gpa": "",
      "courses": []
    }
  ],
  "awards": [],
  "publications": [],
  "skills": [],
  "languages": [
    {
      "language": "French",
      "fluency": "Native speaker"
    },
    {
      "language": "English",
      "fluency": "Fluent"
    }
  ],
  "interests": [],
  "references": []
}
