{
  "basics": {
    "name": "Adrien Kohlbecker",
    "label": "Senior Software Engineer",
    "picture": "https://www.gravatar.com/avatar/2ddf351c22a32261a7b30e4d5ae3ab01?s=600",
    "email": "adrien.kohlbecker@gmail.com",
    "website": "https://adrienkohlbecker.com",
    "summary": "I'm a Senior Software Engineer with a demonstrated experience in the computer software industry. Throughout my career, I have been focusing on building and operating reliable and scalable distributed systems, as well as increasing developer efficiency through automation.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "The Hague",
      "countryCode": "NL",
      "region": ""
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "adrienkohlbecker",
        "url": "https://github.com/adrienkohlbecker"
      },
      {
        "network": "LinkedIn",
        "username": "adrienkohlbecker",
        "url": "https://linkedin.com/in/adrienkohlbecker"
      }
    ]
  },
  "work": [
    {
      "company": "Gitlab",
      "position": "Senior Software Engineer",
      "website": "https://www.gitlab.com",
      "startDate": "2019-06-03",
      "summary": "",
      "highlights": [
      ]
    },
    {
      "company": "Datadog",
      "position": "Senior Software Engineer",
      "website": "https://www.datadoghq.com",
      "startDate": "2017-01-10",
      "endDate": "2018-12-21",
      "summary": "Datadog is a monitoring and analytics platform for cloud-scale application infrastructure. Within the Developer Efficiency team, my role is to help people be successful at their jobs through automation, processes and coaching. Specifically, I’m the main architect and operator behind our CI/CD infrastructure.",
      "highlights": [
        "Designed from scratch and operated day to day our build infrastructure as a service. This includes configuration management and deployment, security hardening and multi-tenancy, secrets, monitoring, availability, SLOs, on-call rotations and post mortems, documentation. Oversaw a fleet of 200 build runners processing a million builds per month, relied upon by 400 engineers across multiple time zones. Built upon Gitlab as container scheduler",
        "Wrote micro services and tools in Go and Python, configuration management in Ruby (chef-solo) and Terraform",
        "Advanced user of AWS services, including IAM hardening, auto-scaling, VPC topology and security, and more",
        "Deep knowledge of Docker and container operations at production scale",
        "Mentored engineers on CI/CD best practices, helping reduce make-work and inefficiencies",
        "Contributor to our local development environment, production artifacts stores and deployment tooling"
      ]
    },
    {
      "company": "Sharette",
      "position": "Technical Founder",
      "website": "https://www.facebook.com/sharette.fr",
      "startDate": "2014-07-01",
      "endDate": "2016-04-04",
      "summary": "Sharette is a carpooling app mixing public transports with car rides in multimodal itineraries. As a technical founder, I built most of the product and managed an engineering team of 4 people.",
      "highlights": [
        "Wrote micro services in Go and Ruby, and a cross-platform mobile app in Typescript and Angular",
        "Researched and designed the routing algorithms powering our multimodal itinerary search",
        "Led the integration of our API in the mobile apps of the Paris public transport company (RATP)",
        "Responsible for a fully automated and monitored container based deployment on AWS",
        "Open sourced the vagrant-fsnotify gem, a vagrant plugin with moderate success on rubygems"
      ]
    },
    {
      "company": "Fidmarques",
      "position": "Software Engineer",
      "website": "https://www.fidmarques.com/",
      "startDate": "2012-10-01",
      "endDate": "2013-06-30",
      "summary": "Fidmarques is a mobile app that extracts and analyses the groceries you bought using a picture of your receipt. I was tasked with building a resilient data processing pipeline and improve developer efficiency with automation.",
      "highlights": [
      ]
    },
    {
      "company": "Gullibear",
      "position": "Technical Founder",
      "website": "https://www.facebook.com/iam.gullibear",
      "startDate": "2011-09-01",
      "endDate": "2012-09-30",
      "summary": "Gullibear is a social network to share and contribute to social economy projects. As a technical founder I built most of the product, using Python and Backbone.js.",
      "highlights": [
      ]
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "École Centrale",
      "studyType": "",
      "area": "",
      "startDate": "2009-09-01",
      "endDate": "2014-12-30",
      "gpa": "",
      "courses": [
        "MSc Engineering focusing on computer science and entrepreneurship.",
        "Highly selective engineering school \"Grande École\" – top 1% at the national level."
      ]
    },
    {
      "institution": "Hanyang University, Seoul (SK)",
      "studyType": "",
      "area": "",
      "startDate": "2012-02-01",
      "endDate": "2012-06-30",
      "gpa": "",
      "courses": [
        "Exchange semester, focusing on computer science and entrepreneurship"
      ]
    }
  ],
  "awards": [],
  "publications": [],
  "skills": [],
  "languages": [
    {
      "language": "French",
      "fluency": "Native speaker"
    },
    {
      "language": "English",
      "fluency": "Fluent"
    }
  ],
  "interests": [
    {
      "name": "Maintaining a production-like home server",
      "keywords": [
      ]
    },
    {
      "name": "Amateur boxing",
      "keywords": [
      ]
    },
    {
      "name": "Drone travel photography",
      "keywords": [
      ]
    }
  ],
  "references": []
}
